<?php

// Определить сложность следующих алгоритмов. Сколько произойдет итераций?
// 1 -> O(100 * 7) -> 700 
$n = 100;
$array[]= [];
for ($i = 0; $i < $n; $i++) { // 100 итераций
    for ($j = 1; $j < $n; $j *= 2) { // 7 итераций
        $array[$i][$j]= true;
    } 
}


// 2 -> O(50 * (100+98+...+2)) -> 2550 
$n = 100;
$array[] = [];
for ($i = 0; $i < $n; $i += 2) { // 50 итераций
    for ($j = $i; $j < $n; $j++) { // 100, 98, 96, 94, 92, ... 2  . Среднее - 51
        $array[$i][$j]= true;
    }    
}

